package com.company;

/*
* Задача:
* Создайте класс, который описывает вектор (в трёхмерном пространстве).
*
* У него должны быть:
* конструктор с параметрами в виде списка координат x, y, z
*
* метод, вычисляющий длину вектора. Корень можно посчитать с помощью Math.sqrt():
*   квадратный корень из суммы квадратов
*
* метод, вычисляющий скалярное произведение:
* x1x2 + y1y2 + z1z2
*
* метод, вычисляющий векторное произведение с другим вектором:
* (y1z2 - z1y2, z1x2 - x1z2, x1y2 - y1x2)
*
* метод, вычисляющий угол между векторами (или косинус угла):
*   косинус угла между векторами равен скалярному произведению векторов,
*   деленному на произведение модулей (длин) векторов:
* (a,b) / (|a|*|b|)
*
* методы для суммы:
* (x1 + x2, y1 + y2, z1 + z2)
* и разности
* (x1 - x2, y1 - y2, z1 - z2)
*
* статический метод, который принимает целое число N, и возвращает массив случайных векторов размером N.
* Если метод возвращает вектор, то он должен возвращать новый объект, а не менять базовый.
* */
public class Vector {
}
